Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino

//  Zegar NTP v5.0 — 24.06.2026 21:41 - finalna wersja produkcyjna
//  Sprzet: Waveshare ESP32-S3-LCD-4.2 (RLCD ST7305 400x300, ES8311, PCF85063A).
//  Arduino IDE: ESP32S3 Dev Module, Flash 8MB, partycja "8M with spiffs".
//  Wymagane pliki obok .ino: photo_font.h
//
//  Hardening v5.0 (przelaczniki ENABLE_* ponizej): watchdog zadania z obsluga
//  snu, ochrona niskiego stanu ogniwa (degradacja + ochronny sen), diagnostyka
//  /info (przyczyna resetu, czas pracy, heap, dryft RTC), wersjonowanie + build
//  info. WiFi/NTP, OTA, factory-reset i logowanie panelu WWW celowo bez zmian.
// ============================================================================

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <Wire.h>
#include <atomic>
#include <ctype.h>
#include <limits.h>
#include <time.h>
#include <sys/time.h>
#include <FS.h>
#include <SPIFFS.h>
#include <LittleFS.h>
#include <FFat.h>
#include <U8g2lib.h>
#include <SPI.h>
#include <Audio.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_sleep.h>
#include <driver/gpio.h>
#include <driver/rtc_io.h>
#include "esp_sntp.h"
#include "esp_task_wdt.h"   // watchdog zadania (TWDT) — hardening 
#include "esp_system.h"     // esp_reset_reason() — diagnostyka 

#include "photo_font.h"

// Deklaracje wyprzedzajace struktur uzywanych w sygnaturach funkcji. MUSZA stac
// przed PIERWSZA definicja funkcji w pliku (watchdogSetup ponizej): Arduino
// auto-generuje prototypy WSZYSTKICH funkcji i wstawia je tuz przed pierwsza
// definicje, w tym drain*(DrainState&) i sanitizeAlarm(AlarmConfig&). Bez nich
// w tym miejscu kompilator zglasza "'DrainState' was not declared". NIE usuwac.
struct AlarmConfig;
struct DrainState;

// ============================================================================
//  WERSJA I INFORMACJE O KOMPILACJI (build info)
// ============================================================================
#define FW_NAME        "Zegar NTP RLCD"
#define FW_VERSION     "5.0"          // finalna wersja produkcyjna
#define FW_BUILD_DATE  __DATE__       // data kompilacji (np. "Jun 22 2026")
#define FW_BUILD_TIME  __TIME__       // godzina kompilacji (np. "18:55:01")

// ============================================================================
//  FLAGI FUNKCJI PRODUKCYJNYCH (hardening) — 1=wlaczone, 0=wylaczone
//  Centralny przelacznik elementow "finalnych". Ustawienie flagi na 0 usuwa jej
//  kod z kompilacji (#if) i przywraca zachowanie sprzed v4.0 — zero narzutu.
// ============================================================================
#define ENABLE_WATCHDOG            1   // sprzetowy reset po zawieszeniu petli (TWDT)
#define ENABLE_LOW_BATTERY_PROTECT 1   // ochrona ogniwa: degradacja + ochronny sen
#define ENABLE_DIAGNOSTICS         1   // strona /info, liczniki resetow, dryft RTC

// ---------------------------------------------------------------------------
//  Watchdog zadania (TWDT)
//  Timeout MUSI byc wiekszy niz najdluzszy light-sleep dzienny
//  (IDLE_LIGHT_SLEEP_MAX_SEC = 60 s). W light-sleep licznik TWDT zwykle stoi
//  (zegar APB bramkowany), ale margines ponad 60 s gwarantuje brak falszywego
//  resetu NIEZALEZNIE od wersji rdzenia ESP32. Realne zawieszenie petli i tak
//  zostaje wylapane w < WDT_TIMEOUT_S. Dlugie operacje blokujace (upload MP3,
//  laczenie WiFi) jawnie karmia watchdog, wiec nie wywoluja resetu.
//  Nocny deep-sleep i ochronny sen rozladowania RESETUJA chip -> TWDT startuje
//  od nowa w setup(), wiec nie wymagaja osobnej obslugi w czasie snu.
// ---------------------------------------------------------------------------
constexpr uint32_t WDT_TIMEOUT_S = 90;

// Inicjalizacja watchdoga dla petli setup()/loop(). Rdzen Arduino zwykle juz
// zainicjowal TWDT (nadzor IDLE) — wtedy tylko rekonfigurujemy timeout. Na
// starszych rdzeniach (2.x) esp_task_wdt_init() ma inna sygnature.
static inline void watchdogSetup() {
#if ENABLE_WATCHDOG
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t cfg = {};
    cfg.timeout_ms     = WDT_TIMEOUT_S * 1000U;
    cfg.idle_core_mask = 0;        // nie nadzoruj IDLE (sny sa celowe) — tylko loopTask
    cfg.trigger_panic  = true;     // timeout -> panic -> reset (odzysk bez nadzoru)
    if (esp_task_wdt_init(&cfg) == ESP_ERR_INVALID_STATE) {
      esp_task_wdt_reconfigure(&cfg);
    }
  #else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
  #endif
  esp_task_wdt_add(NULL);          // nadzoruj biezacy task (loopTask: setup+loop)
  esp_task_wdt_reset();
#endif
}

// Nakarm watchdoga. Wolane na poczatku loop() oraz przed/po snach i dlugich
// operacjach blokujacych (upload MP3, laczenie WiFi).
static inline void watchdogFeed() {
#if ENABLE_WATCHDOG
  esp_task_wdt_reset();
#endif
}

// ---------------------------------------------------------------------------
//  Detektor brownout (spadku napiecia)
//  ESP32-S3 ma sprzetowy brownout-detector wlaczany przez rdzen Arduino
//  (sdkconfig CONFIG_ESP_BROWNOUT_DET, prog domyslny ~2.51 V). CELOWO zostaje
//  WLACZONY: przy zalamaniu napiecia natychmiast resetuje uklad, co chroni FLASH
//  przed uszkodzeniem w trakcie zapisu. Progu nie zmieniamy — w jednoplikowym
//  szkicu .ino nie ma do tego API; wymaga to przebudowy sdkconfig. Zamiast tego
//  programowa ochrona ogniwa (ENABLE_LOW_BATTERY_PROTECT) usypia uklad juz przy
//  ~3.05 V, czyli DUZO powyzej progu sprzetowego — w normalnej pracy brownout nie
//  powinien wystapic. Kazdy reset brownout jest zliczany i widoczny na /info;
//  niezerowy licznik = sygnal slabnacego ogniwa lub przeciazenia.
// ---------------------------------------------------------------------------

// ---------------------------------------------------------------------------
//  power_runtime — estymator zuzycia baterii (dawniej osobny power_runtime.h).
//  Wtopiony tutaj: deliverable = jeden plik .ino + osobny photo_font.h.
//  Czysta arytmetyka na probkach SoC, bez zaleznosci od Arduino/ESP.
// ---------------------------------------------------------------------------
// Powtorzenie deklaracji wyprzedzajacych z poczatku pliku (blok przy watchdogSetup).
// W obecnym ukladzie struktury sa juz zadeklarowane wyzej, wiec tu sa nadmiarowe;
// trzymane lokalnie przy bloku power_runtime, by pozostal samodzielny przy
// ewentualnym wydzieleniu do osobnego pliku. NIE usuwac bez przeniesienia deklaracji.
struct AlarmConfig;
struct DrainState;

#ifndef DRAIN_CAP_MAH
#define DRAIN_CAP_MAH        3400
#endif
#define DRAIN_CHARGE_HYST    5        // wzrost SoC% liczony jako "doladowano" -> reset kotwicy
#define DRAIN_MIN_WINDOW_SEC 21600    // min. 6 h danych przed estymacja

struct DrainState {
  bool     valid;
  int64_t  anchorEpoch;
  uint8_t  anchorSoc;
  int64_t  lastEpoch;
  uint8_t  lastSoc;
};

static inline void drainReset(DrainState &d, int64_t epoch, uint8_t soc) {
  d.valid = true;
  d.anchorEpoch = epoch; d.anchorSoc = soc;
  d.lastEpoch   = epoch; d.lastSoc   = soc;
}

static inline void drainOnSample(DrainState &d, int64_t epoch, uint8_t soc) {
  if (!d.valid) { drainReset(d, epoch, soc); return; }
  if (soc > d.anchorSoc + DRAIN_CHARGE_HYST || soc > d.lastSoc + DRAIN_CHARGE_HYST) {
    drainReset(d, epoch, soc); return;   // wykryto ladowanie -> restart okna
  }
  d.lastEpoch = epoch; d.lastSoc = soc;
}

