Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
// mAh/dobe. <0 => za malo danych; 0 => brak mierzalnego zuzycia.
static inline float drainMahPerDay(const DrainState &d) {
  if (!d.valid) return -1.0f;
  int64_t dt = d.lastEpoch - d.anchorEpoch;
  if (dt < DRAIN_MIN_WINDOW_SEC) return -1.0f;
  int dSoc = (int)d.anchorSoc - (int)d.lastSoc;
  if (dSoc <= 0) return 0.0f;
  return (dSoc / 100.0f) * (float)DRAIN_CAP_MAH / (dt / 86400.0f);
}

// Dni do rozladowania przy biezacym tempie. <0 => nieznane.
static inline float drainDaysRemaining(const DrainState &d, uint8_t curSoc) {
  float perDay = drainMahPerDay(d);
  if (perDay <= 0.0f) return -1.0f;
  return (curSoc / 100.0f) * (float)DRAIN_CAP_MAH / perDay;
}

// ---------------------------------------------------------------------------
//  Adresy I2C
// ---------------------------------------------------------------------------
#define ES8311_ADDR        0x18
#define PCF85063A_ADDR     0x51
#define RTC_FORMAT_MARKER  0xA5

// Kalibracja dryftu krysztalu RTC (rejestr Offset 0x02 PCF85063A).
// Zmierzony dryft: -2 s / 24 h => RTC spoznia sie o ~23,1 ppm (krysztal za wolny).
// MODE=0 (korekcja co 2 h): 1 LSB = 4,34 ppm; wartosc DODATNIA PRZYSPIESZA zegar.
// 23,1 / 4,34 = 5,3 -> +5 LSB = +21,7 ppm; reszta dryftu ~0,13 s / 24 h (<< 1 s).
// Bit 7 (MODE) = 0, bity 6:0 = +5 (uzupelnienie do dwoch) -> bajt 0x05.
#define RTC_OFFSET_REG       0x02
#define RTC_OFFSET_VALUE     0x05

// ---------------------------------------------------------------------------
//  Piny — wyswietlacz RLCD (programowe SPI)
// ---------------------------------------------------------------------------
#define RLCD_SCK_PIN   11
#define RLCD_MOSI_PIN  12
#define RLCD_DC_PIN    5
#define RLCD_CS_PIN    40
#define RLCD_RST_PIN   41
#define LCD_WIDTH      400
#define LCD_HEIGHT     300

// ---------------------------------------------------------------------------
//  Piny — I2C (kodek + RTC), audio I2S, przyciski, akumulator
// ---------------------------------------------------------------------------
#define I2C_SDA_PIN    13
#define I2C_SCL_PIN    14
#define RTC_INT_PIN    15

#define I2S_MCLK_PIN   16
#define I2S_BCLK_PIN   9
#define I2S_WS_PIN     45
#define I2S_DOUT_PIN   8
#define PA_ENABLE_PIN  46

#define KEY_PIN        18    // krotki przycisk: start/odswiezenie panelu WWW (stop sam po 5 min od ostatniej aktywnosci), wyciszenie budzika
#define PREVIEW_BUTTON_PIN 0  // krotki przycisk: podglad najblizszego budzika

#define BATTERY_ADC_CHANNEL          ADC_CHANNEL_3
#define BATTERY_DIVIDER_RATIO        3.0f
#define BATTERY_VOLTAGE_CALIBRATION  1.017f
#define BATTERY_CAPACITY_MAH         3400    // Samsung INR18650-35E (3400 mAh)
#define BATTERY_SAMPLE_COUNT         16
#define BATTERY_EMPTY_VOLTAGE        3.00f
#define BATTERY_FULL_VOLTAGE         4.20f
#define BATTERY_FULL_FLOOR           99
#define BATTERY_FULL_HOLD_FLOOR      98
#define BATTERY_READ_INTERVAL_MS     (10UL * 60UL * 1000UL)
#define BATTERY_BUSY_RETRY_MS        (30UL * 1000UL)   // pod obciazeniem: ponow pomiar za 30 s zamiast czekac pelny interwal

// --- Ochrona niskiego stanu akumulatora (low-battery protection) ------------
//  Dwustopniowa. LOW: degradacja — wstrzymaj auto-NTP/WiFi (najwiekszy pobor
//  pradu); zegar dalej chodzi z RTC, budziki dzialaja, reczny sync z WWW dziala.
//  CRITICAL: ochronny deep-sleep, by NIE rozladowac ogniwa Li-ion ponizej
//  bezpiecznego progu i nie wywolac sprzetowego brownoutu (ryzyko uszkodzenia
//  FLASH przy zapisie). Progi powyzej BATTERY_EMPTY_VOLTAGE (3.00 V) i znacznie
//  powyzej brownoutu sprzetowego, mierzone w spoczynku (OCV).
constexpr uint8_t  BATTERY_LOW_PERCENT          = 15;     // <= 15% -> tryb oszczedny (bez WiFi/NTP)
constexpr float    BATTERY_CRITICAL_VOLTAGE     = 3.05f;  // <= 3.05 V -> ochronny sen
constexpr uint8_t  BATTERY_CRITICAL_PERCENT     = 3;      //   lub <= 3%
constexpr uint32_t BATTERY_CRITICAL_RECHECK_SEC = 30UL * 60UL;  // co ile budzic sie sprawdzic ladowanie

// ---------------------------------------------------------------------------
//  Parametry logiki zegara / budzikow
//  Stale-wartosci jako `constexpr` (typowane, zasiegowe, widoczne w debuggerze).
//  Makrami zostaja tylko flagi uzywane w `#if` (preprocesor nie zna `constexpr`)
//  oraz IDLE_CPU_MHZ sparowane z flaga IDLE_CPU_DOWNCLOCK.
// ---------------------------------------------------------------------------
constexpr int      ALARM_COUNT                = 3;
constexpr int      SOUND_COUNT                = 3;
constexpr int      MAX_AUDIO_VOLUME           = 21;
constexpr uint8_t  DEFAULT_AUDIO_VOLUME       = 10;
constexpr uint8_t  CODEC_VOLUME_PERCENT       = 100;
constexpr uint32_t ALARM_LATE_WINDOW_SEC      = 20;  // budzik moze odpalic do 20 s po terminie (np. po wybudzeniu)
constexpr uint32_t RING_RETRY_MS              = 3000;  // odstep ponawiania odtwarzania w petli dzwonienia
constexpr uint32_t RING_MIN_PLAY_MS           = 750;   // odtwarzanie krotsze = blad pliku (uszkodzony MP3 "konczy sie" po kilkudziesieciu ms)
constexpr uint8_t  RING_MAX_ERRORS            = 10;
constexpr uint32_t RING_TIMEOUT_MS            = 15UL * 60UL * 1000UL;

constexpr uint32_t WEB_WINDOW_MS              = 5UL * 60UL * 1000UL;
constexpr uint32_t WEB_WIFI_GRACE_MS          = 10000;  // tyle czekaj na powrot WiFi (auto-reconnect) zanim okno WWW zostanie zamkniete
constexpr uint32_t WIFI_HINT_FALLBACK_MS      = 5000;   // po nieudanym szybkim BSSID przejdz na pelny skan AP
constexpr uint32_t NTP_RETRY_MS               = 5UL * 60UL * 1000UL;
constexpr uint32_t NTP_INVALID_TIME_RETRY_MS  = NTP_RETRY_MS;
constexpr uint32_t NTP_WIFI_TIMEOUT_MS        = 15000;
constexpr uint32_t NTP_PACKET_TIMEOUT_MS      = 50000;  // lwIP SNTP probuje serwery sekwencyjnie co 15 s (SNTP_RECV_TIMEOUT);
                                                        // 15 s ucinalo probe zanim serwer 2/3 dostal szanse -> 50 s pokrywa wszystkie trzy
constexpr uint32_t NTP_ALARM_CATCHUP_SEC      = 90;
constexpr int      NTP_HOUR                   = 10;  // codzienna synchronizacja w oknie 10:00–10:05
constexpr int      NTP_MIN_WINDOW             = 5;
constexpr uint32_t RTC_WRITE_RETRY_MS         = 5000;
constexpr uint8_t  RTC_WRITE_RETRIES          = 12;
constexpr int      RTC_WAKE_MAX_SKEW_SEC      = 30;

constexpr uint32_t DAY_CPU_MHZ                = 160;
#define POWER_DOWN_FLASH_IN_SLEEP 0   // 1=odlacz flash (VDD_SDIO) w light-sleep dziennym
                                      //   -> najwiekszy spadek pradu bazowego.
                                      //   Restart/niestabilnosc po wgraniu? Ustaw 0 i wgraj ponownie.
constexpr uint32_t NIGHT_CPU_MHZ              = 40;
#define FAST_NTP_RECONNECT 1   // 1=uzyj zapamietanego kanalu+BSSID (szybsze laczenie, krocej radia)
#define IDLE_CPU_DOWNCLOCK 0   // 1=80 MHz w bezczynnosci zegara (drobna oszczednosc).
                               //   OFF domyslnie: dotyka taktowania audio, brak testu.
#define IDLE_CPU_MHZ       80
#define ST7305_STATIC_LPM 0   // 0=WYLACZONE. Tryb niskiego poboru panelu przy statycznym
                              //   obrazie. Nieprzetestowana komenda panelu (jak zaklad o
                              //   deep-sleep) -> wlaczyc DOPIERO gdy mozliwy test sprzetowy.
constexpr uint64_t IDLE_LIGHT_SLEEP_US        = 900000ULL;  // fallback gdy czas nieznany (brak RTC/NTP)
constexpr uint64_t IDLE_LIGHT_SLEEP_MAX_SEC   = 60ULL;  // gorny limit dynamicznego light-sleep w dzien (sen do granicy minuty -> 1 wybudzenie/min)
constexpr int      NIGHT_START_HOUR           = 23;
constexpr int      NIGHT_START_MIN            = 59;
constexpr int      NIGHT_END_HOUR             = 6;
constexpr int      NIGHT_END_MIN              = 0;
constexpr uint32_t NIGHT_MIN_SLEEP_SEC        = 5;
constexpr uint32_t NIGHT_FALLBACK_CHUNK_SEC   = 3600;  // maks. odcinek snu nocnego, gdy alarm RTC nie uzbroil sie (budzenie tylko timerem RC)
constexpr uint32_t NIGHT_FALLBACK_ALARM_CHUNK_SEC = 300;  // jw., ale gdy najblizszym zdarzeniem jest budzik: krotsze odcinki -> dryft RC ostatniego << NTP_ALARM_CATCHUP_SEC (90 s), inaczej spoznione wybudzenie gubi budzik

