Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
constexpr uint32_t BUTTON_DEBOUNCE_MS         = 40;
constexpr uint32_t BOOT_SHORT_PRESS_MS        = 1200;
constexpr uint32_t ALARM_PREVIEW_MS           = 5000;

// ---------------------------------------------------------------------------
//  Stale konfiguracyjne
// ---------------------------------------------------------------------------
static const char *TZ_POLAND   = "CET-1CEST,M3.5.0/2,M10.5.0/3";
static const char *NTP_SERVER_1 = "pool.ntp.org";
static const char *NTP_SERVER_2 = "time.google.com";
static const char *NTP_SERVER_3 = "time.cloudflare.com";

static const char *DEFAULT_WIFI_SSID = "";
static const char *DEFAULT_WIFI_PASS = "";

// Pliki dzwiekow — indeks 0..2 odpowiada wyborowi w panelu WWW.
static const char *SOUND_FILES[SOUND_COUNT] = {
  "/alarm1.mp3",
  "/alarm2.mp3",
  "/alarm3.mp3"
};
static const char *SOUND_NAMES[SOUND_COUNT] = {
  "Dzwiek 1",
  "Dzwiek 2",
  "Dzwiek 3"
};

// ---------------------------------------------------------------------------
//  Sterownik kodeka ES8311 (sekwencja rejestrow — inicjalizacja sprzetowa)
// ---------------------------------------------------------------------------
class ES8311Codec {
public:
  explicit ES8311Codec(TwoWire *bus = &Wire) : wire_(bus) {}

  bool begin(int32_t sda, int32_t scl, uint32_t freq) {
    if (sda < 0 || scl < 0) return false;
    wire_->begin(sda, scl, freq);
    wire_->beginTransmission(ES8311_ADDR);
    if (wire_->endTransmission() != 0) return false;

    bool ok = true;
    ok &= write(0x00, 0x1F);
    delay(20);
    ok &= write(0x00, 0x00);
    ok &= write(0x00, 0x80);
    ok &= write(0x01, 0x3F);
    ok &= write(0x06, read(0x06) & ~(1 << 5));
    ok &= configSampleRate48k();
    ok &= configBits16();
    ok &= write(0x0D, 0x01);
    ok &= write(0x0E, 0x02);
    ok &= write(0x12, 0x00);
    ok &= write(0x13, 0x10);
    ok &= write(0x1C, 0x6A);
    ok &= write(0x37, 0x08);
    return ok;
  }

  bool configBits16() {
    return write(0x09, 0x0C) && write(0x0A, 0x0C);
  }

  // Glosnosc wyjscia kodeka 0..100% (0 = mute). Mapowanie liniowe na rejestr 0x32
  // do 0xD7 (ok. +12 dB): glosniej niz 0xBF = 0 dB, ale z mniejszym ryzykiem
  // przesterowania niz przy maksymalnym cyfrowym wzmocnieniu 0xFF.
  bool setVolume(uint8_t percent) {
    if (percent > 100) percent = 100;
    uint8_t reg = (uint8_t)(((uint16_t)percent * 215u) / 100u);
    return write(0x32, reg);
  }

  // Pelne uspienie kodeka: wycisz DAC i wprowadz uklad w reset (bloki analogowe
  // off). To najwiekszy odbiornik w spoczynku, a begin() niezawodnie go budzi.
  bool powerDown() {
    write(0x32, 0x00);          // mute DAC
    return write(0x00, 0x1F);   // assert reset -> analog off (minimalny pobor)
  }

private:
  TwoWire *wire_;

  bool write(uint8_t reg, uint8_t value) {
    wire_->beginTransmission(ES8311_ADDR);
    wire_->write(reg);
    wire_->write(value);
    return wire_->endTransmission() == 0;
  }

  uint8_t read(uint8_t reg) {
    wire_->beginTransmission(ES8311_ADDR);
    wire_->write(reg);
    wire_->endTransmission(false);
    wire_->requestFrom((uint16_t)ES8311_ADDR, (uint8_t)1, true);
    return wire_->available() ? wire_->read() : 0;
  }

  bool configSampleRate48k() {
    bool ok = true;
    ok &= write(0x02, 0x00);
    ok &= write(0x03, 0x10);
    ok &= write(0x04, 0x10);
    ok &= write(0x05, 0x00);
    ok &= write(0x06, (read(0x06) & 0xE0) | 0x03);
    ok &= write(0x07, 0x00);
    ok &= write(0x08, 0xFF);
    return ok;
  }
};

// ---------------------------------------------------------------------------
//  Model danych
// ---------------------------------------------------------------------------
struct AlarmConfig {
  uint8_t enabled;
  uint8_t hour;
  uint8_t minute;
  uint8_t second;
  uint8_t volume;     // 0..MAX_AUDIO_VOLUME
  uint8_t sound;      // indeks 0..SOUND_COUNT-1 → SOUND_FILES
  char    label[16];
};

// ---------------------------------------------------------------------------
//  Obiekty globalne
// ---------------------------------------------------------------------------
// RST = U8X8_PIN_NONE: U8g2 nigdy sam nie pulsuje resetu. RST sterujemy recznie w
// setupDisplay() przy KAZDYM wejsciu w setup() (zimny start ORAZ wybudzenie z
// deep-sleep — ten egzemplarz ST7305 nie trzyma obrazu przez deep-sleep, patrz
// setupDisplay). W dzien petla uzywa light-sleep, wiec setup()/setupDisplay() NIE
// wykonuja sie ponownie: panel nie jest resetowany i trzyma obraz -> brak mrugania.
static U8G2_ST7305_300X400_F_4W_HW_SPI display(
  U8G2_R1, RLCD_CS_PIN, RLCD_DC_PIN, U8X8_PIN_NONE);
static U8G2 *gfx = &display;

static WebServer  server(80);
static Preferences prefs;
static Audio       audio;
static ES8311Codec codec;

static adc_oneshot_unit_handle_t batteryAdc  = nullptr;
static adc_cali_handle_t         batteryCali = nullptr;

// ---------------------------------------------------------------------------
//  Stan
// ---------------------------------------------------------------------------
static AlarmConfig alarms[ALARM_COUNT];
static char wifiSsid[33] = "";
static char wifiPass[65] = "";

static bool   webActive = false;
static bool   webRoutesInstalled = false;
static uint32_t webUntilMs = 0;

static bool      fsMounted = false;
static fs::FS   *dataFS = nullptr;
static const char *dataFSName = "brak";
static File      mp3UploadFile;
static bool      mp3UploadAccepted = false;
static bool      mp3UploadHadData = false;
static String    mp3UploadPath = "";
static String    mp3UploadTempPath = "";

static bool   audioReady = false;
static bool   batteryReady = false;
static bool   batteryCaliReady = false;
static bool   displayDirty = true;

static bool      playing = false;          // trwa odtwarzanie pliku MP3
static String    statusText = "IDLE";
static String    ntpStatus = "never";

// RTC RAM: przezywa deep-sleep (noc / krytyczna bateria rebootuja uklad). Bez tego
// kazde wybudzenie z deep-sleep zerowaloby je i histereza "trzymaj 100% gdy pomiar
// >= 98%" (stabilizePercent) by nie dzialala -> ekran migalby 99<->100 przy pelnym
// ogniwie. Zerowane na cold boot.
static RTC_DATA_ATTR uint8_t batteryPercent;
static RTC_DATA_ATTR float   batteryVoltage;
static RTC_DATA_ATTR bool    batteryHasReading;

