Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
static void resetTriggerState() {
  for (int i = 0; i < ALARM_COUNT; i++) lastTriggerDay[i] = -1;
}

static void sanitizeAlarm(AlarmConfig &alarm, int index) {
  alarm.enabled = alarm.enabled ? 1 : 0;
  if (alarm.hour > 23) alarm.hour = 7;
  if (alarm.minute > 59) alarm.minute = 0;
  if (alarm.second > 59) alarm.second = 0;
  if (alarm.volume > MAX_AUDIO_VOLUME) alarm.volume = DEFAULT_AUDIO_VOLUME;
  if (alarm.sound >= SOUND_COUNT) alarm.sound = (uint8_t)(index % SOUND_COUNT);
  alarm.label[sizeof(alarm.label) - 1] = '\0';
  if (alarm.label[0] == '\0') {
    snprintf(alarm.label, sizeof(alarm.label), "Budzik %d", index + 1);
  }
}

static void sanitizeAlarms() {
  for (int i = 0; i < ALARM_COUNT; i++) sanitizeAlarm(alarms[i], i);
}

static void loadSettings() {
  setDefaultAlarms();
  if (!prefs.begin(NVS_NS, false)) {
    strncpy(wifiSsid, DEFAULT_WIFI_SSID, sizeof(wifiSsid) - 1);
    strncpy(wifiPass, DEFAULT_WIFI_PASS, sizeof(wifiPass) - 1);
    wifiSsid[sizeof(wifiSsid) - 1] = 0;
    wifiPass[sizeof(wifiPass) - 1] = 0;
    return;
  }
  if (prefs.getBytesLength("alarms") == sizeof(alarms)) {
    prefs.getBytes("alarms", alarms, sizeof(alarms));
  }
  sanitizeAlarms();
  String ssid = prefs.getString("ssid", DEFAULT_WIFI_SSID);
  String pass = prefs.getString("pass", DEFAULT_WIFI_PASS);
  if (ssid.length() == 0) { ssid = DEFAULT_WIFI_SSID; pass = DEFAULT_WIFI_PASS; }
  ssid.toCharArray(wifiSsid, sizeof(wifiSsid));
  pass.toCharArray(wifiPass, sizeof(wifiPass));
  prefs.end();
}

static void saveSettings() {
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putBytes("alarms", alarms, sizeof(alarms));
  prefs.putString("ssid", wifiSsid);
  prefs.putString("pass", wifiPass);
  prefs.end();
}

// ============================================================================
//  Diagnostyka produkcyjna — przyczyna resetu i jej liczniki
// ============================================================================
static const char *resetReasonText(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "zasilanie (zimny start)";
    case ESP_RST_EXT:       return "zewnetrzny pin RST";
    case ESP_RST_SW:        return "software (esp_restart)";
    case ESP_RST_PANIC:     return "panic / wyjatek";
    case ESP_RST_INT_WDT:   return "watchdog przerwan";
    case ESP_RST_TASK_WDT:  return "watchdog zadania (TWDT)";
    case ESP_RST_WDT:       return "inny watchdog";
    case ESP_RST_DEEPSLEEP: return "deep-sleep (planowe)";
    case ESP_RST_BROWNOUT:  return "brownout (spadek napiecia)";
    case ESP_RST_SDIO:      return "SDIO";
    default:                return "nieznany";
  }
}

// Wczytaj dozywotnie liczniki resetow z NVS i — jesli ten rozruch jest skutkiem
// brownoutu/panic/WDT — zwieksz odpowiedni licznik. Zdarzenia rzadkie, wiec
// zapis do flash jest bezpieczny. Cold boot / deep-sleep nie zapisuja nic.
static void recordResetReason(esp_reset_reason_t r) {
  if (!prefs.begin(NVS_NS, false)) return;
  g_brownoutResets = prefs.getUInt("rstBrown", 0);
  g_wdtResets      = prefs.getUInt("rstWdt",   0);
  g_panicResets    = prefs.getUInt("rstPanic", 0);
  if (r == ESP_RST_BROWNOUT) {
    prefs.putUInt("rstBrown", ++g_brownoutResets);
  } else if (r == ESP_RST_TASK_WDT || r == ESP_RST_INT_WDT || r == ESP_RST_WDT) {
    prefs.putUInt("rstWdt", ++g_wdtResets);
  } else if (r == ESP_RST_PANIC) {
    prefs.putUInt("rstPanic", ++g_panicResets);
  }
  prefs.end();
}

// ============================================================================
//  WiFi + NTP
// ============================================================================
// Ustawiana w callbacku SNTP po realnym odebraniu czasu z serwera (nie z RTC).
static std::atomic<bool> g_ntpGotPacket{false};
static std::atomic<bool> g_ntpAcceptPacket{false};
static void onSntpSync(struct timeval *tv) {
  if (tv && g_ntpAcceptPacket.load(std::memory_order_acquire)) {
    g_ntpGotPacket.store(true, std::memory_order_release);
  }
}

enum NtpSyncState : uint8_t {
  NTP_SYNC_IDLE,
  NTP_SYNC_WIFI_CONNECTING,
  NTP_SYNC_WAITING_PACKET
};

static NtpSyncState ntpSyncState = NTP_SYNC_IDLE;
static bool         ntpManualAttempt = false;
static bool         ntpHadValidTimeBeforeAttempt = false;
static bool         ntpWifiHintActive = false;
static uint32_t     ntpStateStartedMs = 0;
static struct timeval ntpFallbackTime = {};
static uint32_t     ntpFallbackMs = 0;

static void restoreTimeAfterFailedNtp();

static void stopSntpCallbacks() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  if (esp_sntp_enabled()) esp_sntp_stop();
  sntp_set_time_sync_notification_cb(nullptr);
}

static void stopWifiAndNtp() {
  bool canceledAttempt = ntpSyncState != NTP_SYNC_IDLE;
  stopSntpCallbacks();
  if (ntpSyncState == NTP_SYNC_WAITING_PACKET) restoreTimeAfterFailedNtp();
  ntpSyncState = NTP_SYNC_IDLE;
  ntpManualAttempt = false;
  ntpWifiHintActive = false;
  g_ntpGotPacket.store(false, std::memory_order_release);
  if (canceledAttempt && ntpRetriesLeft == 0 && !isSupportedEpoch(time(nullptr))) {
    ntpRetriesLeft = 1;
    ntpNextRetryMs = millis() + NTP_INVALID_TIME_RETRY_MS;
  }
  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_OFF);
}

static bool wifiBeginSmart() {
  WiFi.persistent(false);
#if FAST_NTP_RECONNECT
  if (g_wifiHint) {
    WiFi.begin(wifiSsid, wifiPass, g_wifiChannel, g_wifiBssid);
    return true;
  }
#endif
  WiFi.begin(wifiSsid, wifiPass);
  return false;
}

static void wifiRetryFullScan() {
#if FAST_NTP_RECONNECT
  g_wifiHint = false;
#endif
  WiFi.disconnect(false, false);
  WiFi.begin(wifiSsid, wifiPass);
}

static void wifiCacheHint() {
#if FAST_NTP_RECONNECT
  if (WiFi.status() == WL_CONNECTED) {
    g_wifiChannel = WiFi.channel();
    const uint8_t *b = WiFi.BSSID();
    if (b) { for (int i = 0; i < 6; i++) g_wifiBssid[i] = b[i]; g_wifiHint = true; }
  }
#endif
}

static bool ensureWifi(uint32_t timeoutMs) {
  if (strlen(wifiSsid) == 0) return false;
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  if (WiFi.status() != WL_CONNECTED) {
    bool usedHint = wifiBeginSmart();
    bool retriedFullScan = false;
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
      if (usedHint && !retriedFullScan &&
          millis() - start >= WIFI_HINT_FALLBACK_MS) {
        retriedFullScan = true;
        wifiRetryFullScan();
      }
      delay(100);
      yield();
      watchdogFeed();   // laczenie WiFi blokuje do timeoutMs (~15 s) — nie pozwol na falszywy reset
    }
  }
  bool ok = WiFi.status() == WL_CONNECTED;
  if (ok) wifiCacheHint(); else g_wifiHint = false;   // fallback: nastepna proba pelny skan
  return ok;
}

static void scheduleRtcWriteRetry(uint8_t retries = RTC_WRITE_RETRIES) {
  rtcWriteRetriesLeft = retries;
  rtcWriteNextRetryMs = millis() + RTC_WRITE_RETRY_MS;
}

static void handleRtcWriteRetry() {
  if (rtcWriteRetriesLeft == 0 ||
      (int32_t)(millis() - rtcWriteNextRetryMs) < 0) return;

  if (writeRtc(time(nullptr))) {
    rtcWriteRetriesLeft = 0;
    ntpStatus = "NTP OK, RTC OK";
  } else if (--rtcWriteRetriesLeft > 0) {
    rtcWriteNextRetryMs = millis() + RTC_WRITE_RETRY_MS;
    ntpStatus = "NTP OK, RTC retry";
  } else {
    ntpStatus = "NTP OK, RTC ERR";
  }
  displayDirty = true;
}

