Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
static void scheduleNtpRetry(uint8_t retries, uint32_t delayMs = NTP_RETRY_MS) {
  ntpRetriesLeft = retries;
  ntpNextRetryMs = millis() + delayMs;
}

static void restoreTimeAfterFailedNtp() {
  if (isSupportedEpoch(ntpFallbackTime.tv_sec)) {
    uint64_t elapsedUs = (uint64_t)(millis() - ntpFallbackMs) * 1000ULL;
    struct timeval restored = ntpFallbackTime;
    restored.tv_sec += (time_t)(elapsedUs / 1000000ULL);
    restored.tv_usec += (suseconds_t)(elapsedUs % 1000000ULL);
    if (restored.tv_usec >= 1000000) {
      restored.tv_sec++;
      restored.tv_usec -= 1000000;
    }
    settimeofday(&restored, nullptr);
  } else {
    setSystemEpoch(0);
  }
}

static void finishNtpAttempt(bool ok) {
  bool wasManual = ntpManualAttempt;
  ntpSyncState = NTP_SYNC_IDLE;
  ntpManualAttempt = false;
  ntpWifiHintActive = false;
  stopSntpCallbacks();
  g_ntpGotPacket.store(false, std::memory_order_release);

  if (ok) {
    ntpRetriesLeft = 0;
  } else {
    if (!wasManual && ntpRetriesLeft > 0) {
      // ntpFailureRetryDelayMs obowiazuje przez CALA serie ponowien (np. 6x30 s po
      // zimnym starcie bez RTC). Wczesniejszy reset na NTP_RETRY_MS po pierwszym
      // ponowieniu rozciagal odzysk czasu po awarii zasilania do ~26 minut.
      ntpNextRetryMs = millis() + ntpFailureRetryDelayMs;
    } else if (!ntpHadValidTimeBeforeAttempt || !isSupportedEpoch(time(nullptr))) {
      // Bez poprawnego RTC nie ma lokalnej daty, wiec ponawiaj az NTP zadziala.
      scheduleNtpRetry(1, NTP_INVALID_TIME_RETRY_MS);
    }
  }

  if (!webActive) {
    WiFi.disconnect(false, false);
    WiFi.mode(WIFI_OFF);
  }
  displayDirty = true;
}

static void beginNtpRequest() {
  // Callback odroznia realny pakiet NTP od czasu ustawionego wczesniej z RTC.
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  g_ntpGotPacket.store(false, std::memory_order_release);
  sntp_set_time_sync_notification_cb(onSntpSync);   // przed configTzTime
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
  gettimeofday(&ntpFallbackTime, nullptr);
  ntpFallbackMs = millis();
  g_ntpAcceptPacket.store(true, std::memory_order_release);
  configTzTime(TZ_POLAND, NTP_SERVER_1, NTP_SERVER_2, NTP_SERVER_3);
  ntpSyncState = NTP_SYNC_WAITING_PACKET;
  ntpStateStartedMs = millis();
  ntpStatus = "oczekiwanie na NTP";
  displayDirty = true;
}

static bool syncNtp(bool manual) {
  if (ntpSyncState != NTP_SYNC_IDLE) return false;
  if (manual) ntpRetriesLeft = 0;
  ntpManualAttempt = manual;
  ntpHadValidTimeBeforeAttempt = isSupportedEpoch(time(nullptr));
  ntpStatus = manual ? "manual: laczenie WiFi" : "auto: laczenie WiFi";
  displayDirty = true;

  if (strlen(wifiSsid) == 0) {
    ntpStatus = "brak SSID WiFi";
    finishNtpAttempt(false);
    return false;
  }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  if (WiFi.status() == WL_CONNECTED) {
    beginNtpRequest();
  } else {
    ntpWifiHintActive = wifiBeginSmart();
    ntpSyncState = NTP_SYNC_WIFI_CONNECTING;
    ntpStateStartedMs = millis();
  }
  return true;
}

static bool serviceNtp() {
  if (ntpSyncState == NTP_SYNC_WIFI_CONNECTING) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiCacheHint();
      beginNtpRequest();
    } else if (ntpWifiHintActive &&
               millis() - ntpStateStartedMs >= WIFI_HINT_FALLBACK_MS) {
      ntpWifiHintActive = false;
      ntpStatus = "WiFi: pelny skan";
      wifiRetryFullScan();
      ntpStateStartedMs = millis();
      displayDirty = true;
    } else if (millis() - ntpStateStartedMs >= NTP_WIFI_TIMEOUT_MS) {
      ntpStatus = "blad WiFi";
      g_wifiHint = false;
      finishNtpAttempt(false);
    }
    return false;
  }

  if (ntpSyncState != NTP_SYNC_WAITING_PACKET) return false;

  if (g_ntpGotPacket.load(std::memory_order_acquire)) {
    // Po pierwszej odpowiedzi nie pozwalaj kolejnemu pakietowi zmienic czasu
    // pomiedzy jego odczytem a zatwierdzeniem tego samego czasu w RTC.
    stopSntpCallbacks();
    time_t syncedEpoch = time(nullptr);
    struct tm local = {};
    if (!isSupportedEpoch(syncedEpoch)) {
      restoreTimeAfterFailedNtp();
      ntpStatus = "bledny czas NTP";
      finishNtpAttempt(false);
      return false;
    }
    localtime_r(&syncedEpoch, &local);

#if ENABLE_DIAGNOSTICS
    // Dryft RTC: porownaj STARY czas RTC (jeszcze nie nadpisany) z czasem NTP.
    // Na pierwszej synchronizacji (RTC pusty) readRtcEpoch zawodzi -> brak wpisu.
    {
      time_t oldRtc;
      if (readRtcEpoch(&oldRtc)) g_lastRtcDriftSec = (int32_t)(oldRtc - syncedEpoch);
      g_prevNtpSyncEpoch = g_lastNtpSyncEpoch;
      g_lastNtpSyncEpoch = (int64_t)syncedEpoch;
    }
#endif

    bool rtcOk = writeRtc(syncedEpoch);
    if (rtcOk) rtcWriteRetriesLeft = 0;
    else scheduleRtcWriteRetry();
    char buf[48];
    snprintf(buf, sizeof(buf), "OK %02d:%02d:%02d RTC:%s",
             local.tm_hour, local.tm_min, local.tm_sec, rtcOk ? "OK" : "RETRY");
    ntpStatus = buf;
    ntpStartedDay = localDayKey(local);
    finishNtpAttempt(true);
    return true;
  }

  if (millis() - ntpStateStartedMs >= NTP_PACKET_TIMEOUT_MS) {
    // Zatrzymaj SNTP i cofnij ewentualna spozniona/niepelna zmiane czasu.
    stopSntpCallbacks();
    restoreTimeAfterFailedNtp();
    ntpStatus = "blad NTP";
    finishNtpAttempt(false);
  }
  return false;
}

static bool handleNtpRetry() {
  if (ntpSyncState != NTP_SYNC_IDLE) return true;
  if (ntpRetriesLeft == 0) return false;
  if ((int32_t)(millis() - ntpNextRetryMs) < 0) return true;

  --ntpRetriesLeft;
  syncNtp(false);
  return true;
}

// ============================================================================
//  System plikow z dzwiekami
// ============================================================================
// Dokoncz przerwana zanikiem zasilania podmiane pliku dzwiekowego. Skan
// calego katalogu obejmuje takze MP3 wgrane przez WWW, nie tylko
// /alarm1-3.mp3: *.bak bez pliku docelowego wraca na swoje miejsce,
// osierocone *.bak/*.part sa usuwane.
// Jeden przebieg; true po pierwszej zmianie w FS. Iterowanie katalogu w
// trakcie kasowania/przenoszenia bywa zawodne (SPIFFS), wiec po kazdej
// zmianie skan startuje od poczatku.
static bool recoverSoundFilesOnce() {
  File root = dataFS->open("/");
  if (!root) return false;
  for (File f = root.openNextFile(); f; f = root.openNextFile()) {
    bool isDir = f.isDirectory();
    String path = f.name();
    f.close();
    if (isDir) continue;
    if (!path.startsWith("/")) path = String("/") + path;
    String lower = path;
    lower.toLowerCase();

