Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
static void drawPreviewPage() {
  uint8_t nh = 0, nm = 0, ns = 0;
  char label[sizeof(alarms[0].label)] = "";
  int next = nextAlarmIndex(&nh, &nm, &ns, label, sizeof(label));

  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);
  if (next >= 0) {
    drawBellIcon(10, 8, true);
    gfx->setFont(u8g2_font_9x15_tf);
    drawCentered("NAJBLIZSZY BUDZIK", 25);
    drawLargeTime(nh, nm, 60);
    gfx->drawHLine(0, 264, LCD_WIDTH);
    char detail[96];
    snprintf(detail, sizeof(detail), "%s  %02u:%02u:%02u  [%s]",
             label, nh, nm, ns, SOUND_NAMES[alarms[next].sound % SOUND_COUNT]);
    drawCentered(detail, 287);
  } else {
    drawBellIcon(185, 35, false);
    gfx->setFont(u8g2_font_logisoso50_tf);
    drawCentered("--:--", 150);
    gfx->setFont(u8g2_font_9x15_tf);
    drawCentered("Brak aktywnego budzika", 215);
  }
  gfx->sendBuffer();
  lastClockSig = 0xFFFFFFFFu;   // powrot do zegara musi wymusic repaint
}

static void drawRingingPage() {
  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);
  drawBellIcon(185, 35, true);
  gfx->setFont(u8g2_font_logisoso50_tf);
  drawCentered("BUDZIK", 150);
  gfx->setFont(u8g2_font_9x15_tf);
  drawCentered(statusText.c_str(), 210);
  drawCentered("Przycisk = wycisz", 245);
  gfx->sendBuffer();
  lastClockSig = 0xFFFFFFFFu;   // powrot do zegara musi wymusic repaint
}

static void drawNightPage() {
  gfx->clearBuffer();
  gfx->setDrawColor(1);
  gfx->setFont(u8g2_font_7x14_tf);
  drawCentered("TRYB NOCNY 23:59 - 06:00", 150);
  gfx->sendBuffer();
  displayDirty = false;
  lastClockSig = 0xFFFFFFFFu;   // po wybudzeniu zegar zawsze repaint
}

#if ENABLE_LOW_BATTERY_PROTECT
static void drawCriticalBatteryPage() {
  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);
  gfx->setFont(u8g2_font_logisoso32_tf);
  drawCentered("ROZLADOWANY", 120);
  gfx->setFont(u8g2_font_9x15_tf);
  drawCentered("Podlacz ladowarke", 165);
  char b[40];
  snprintf(b, sizeof(b), "%u%%  %.2f V", batteryPercent, batteryVoltage);
  drawCentered(b, 200);
  gfx->sendBuffer();
  lastClockSig = 0xFFFFFFFFu;
}
#endif

static void updateDisplay() {
  if (playing || ringing) {
    if (displayDirty) { drawRingingPage(); displayDirty = false; }
    return;
  }
  if (previewActive) {
    if ((int32_t)(millis() - previewUntilMs) < 0) {
      if (displayDirty) { drawPreviewPage(); displayDirty = false; }
      return;
    }
    previewActive = false;
    displayDirty = true;
  }

  struct tm t;
  if (!getLocalTm(&t)) {
    if (displayDirty) {
      gfx->clearBuffer();
      gfx->setDrawColor(1);
      gfx->setFont(u8g2_font_9x15_tf);
      drawCentered("Brak czasu RTC/NTP", 135);
      drawCentered(ntpStatus.c_str(), 170);
      gfx->sendBuffer();
      displayDirty = false;
      lastClockSig = 0xFFFFFFFFu;   // gdy czas wroci, wymus repaint zegara
    }
    return;
  }

  int day = localDayKey(t);
  uint32_t sig = clockSig(t, day);
  // Repaint TYLKO gdy zmienia sie widoczna tresc zegara. displayDirty ustawiane
  // przez zmiany statusu NTP/MP3 (niepokazywane tutaj) jest jedynie konsumowane,
  // wiec synchronizacja NTP i sesja WWW nie wywoluja repaintu identycznej klatki.
  if (sig != lastClockSig) {
    drawClockPage(t);
    lastDrawMinute = t.tm_min;
    lastDrawDay = day;
    lastClockSig = sig;
  }
  displayDirty = false;
}

// ============================================================================
//  Panel WWW
// ============================================================================
static String htmlEscape(const String &v) {
  String out;
  out.reserve(v.length() + 8);
  for (size_t i = 0; i < v.length(); i++) {
    char c = v[i];
    if (c == '&') out += F("&amp;");
    else if (c == '<') out += F("&lt;");
    else if (c == '>') out += F("&gt;");
    else if (c == '"') out += F("&quot;");
    else if (c == '\'') out += F("&#39;");
    else out += c;
  }
  return out;
}

static bool parseClock(const String &v, uint8_t *h, uint8_t *mi, uint8_t *s) {
  int hh = 0, mm = 0, ss = 0;
  int consumed = 0;
  int n = sscanf(v.c_str(), "%d:%d:%d%n", &hh, &mm, &ss, &consumed);
  if (n == 2) {
    ss = 0;
    consumed = 0;
    if (sscanf(v.c_str(), "%d:%d%n", &hh, &mm, &consumed) != 2) return false;
  }
  if (n < 2 || hh < 0 || hh > 23 || mm < 0 || mm > 59 || ss < 0 || ss > 59) return false;
  while (consumed < (int)v.length() && isspace((unsigned char)v[consumed])) consumed++;
  if (consumed != (int)v.length()) return false;
  *h = (uint8_t)hh; *mi = (uint8_t)mm; *s = (uint8_t)ss;
  return true;
}

static String currentTimeText() {
  struct tm t;
  if (!getLocalTm(&t)) return "czas nieustawiony";
  char buf[48];
  snprintf(buf, sizeof(buf), "%04d-%02d-%02d %02d:%02d:%02d",
           t.tm_year + 1900, t.tm_mon + 1, t.tm_mday, t.tm_hour, t.tm_min, t.tm_sec);
  return String(buf);
}

static bool isMp3NameChar(char c) {
  return (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
         (c >= '0' && c <= '9') || c == '_' || c == '-' || c == '.';
}

// keepCase: kasowanie istniejacych plikow musi uzyc dokladnie tej nazwy, ktora
// pokazuje lista WWW (SPIFFS/LittleFS rozroznia wielkosc liter; plik /Alarm.MP3
// wgrany narzedziem PC bylby nieusuwalny po zlowercase'owaniu). Upload nadal
// normalizuje nazwy do malych liter.
static bool normalizeMp3Path(String name, String &path, bool keepCase) {
  name.trim();
  name.replace("\\", "/");
  int slash = name.lastIndexOf('/');
  if (slash >= 0) name = name.substring(slash + 1);
  name.trim();
  // SPIFFS ogranicza pelna sciezke do 31 znakow, a upload pisze "/<nazwa>.part"
  // (1 + nazwa + 5). Dluzsze nazwy przechodzily walidacje i padaly dopiero na
  // open() z mylacym "blad zapisu MP3".
  if (name.length() < 5 || name.length() > 25) return false;

  String lower = name;
  lower.toLowerCase();
  if (!lower.endsWith(".mp3")) return false;
  if (!keepCase) name = lower;

  for (size_t i = 0; i < name.length(); i++) {
    if (!isMp3NameChar(name[i])) return false;
  }

  path = String("/") + name;
  return true;
}

static String formatFileSize(size_t bytes) {
  if (bytes < 1024) return String((uint32_t)bytes) + " B";
  if (bytes < 1024UL * 1024UL) return String(bytes / 1024.0f, 1) + " KB";
  return String(bytes / (1024.0f * 1024.0f), 2) + " MB";
}

static void appendMp3Manager(String &html) {
  html += F("<section><b>Pliki MP3</b>");
  if (!ensureFsMounted()) {
    html += F("<p>Brak zamontowanego systemu plikow.</p></section>");
    return;
  }

  html += F("<p class='muted'>System plikow: ");
  html += htmlEscape(dataFSName);
  html += F("</p><form method='post' action='/mp3upload' enctype='multipart/form-data'>"
            "<div class='row'><input type='file' name='mp3' accept='.mp3,audio/mpeg' required>"
            "<button type='submit'>Dodaj / nadpisz MP3</button></div></form>");

  html += F("<table><tr><th>Plik</th><th>Rozmiar</th><th></th></tr>");
  bool any = false;
  File root = dataFS->open("/");
  if (root) {
    File file = root.openNextFile();
    while (file) {
      if (!file.isDirectory()) {
        String path = file.name();
        if (!path.startsWith("/")) path = String("/") + path;
        String lower = path;
        lower.toLowerCase();
        if (lower.endsWith(".mp3")) {
          any = true;
          html += F("<tr><td>");
          html += htmlEscape(path);
          html += F("</td><td>");
          html += formatFileSize(file.size());
          html += F("</td><td><form method='post' action='/mp3delete' style='display:inline'>"
                    "<input type='hidden' name='file' value='");
          html += htmlEscape(path);
          html += F("'><button type='submit'>Usun</button></form></td></tr>");
        }
      }
      file.close();
      file = root.openNextFile();
    }
    root.close();
  }
  if (!any) html += F("<tr><td colspan='3'>Brak plikow MP3</td></tr>");
  html += F("</table><p class='muted'>Nazwy plikow: litery/cyfry oraz _ - ., maks. 25 znakow; budziki domyslnie uzywaja /alarm1.mp3, /alarm2.mp3 i /alarm3.mp3.</p></section>");
}

