Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
static time_t nightEndEpoch(time_t now) {
  if (!isSupportedEpoch(now)) return 0;
  struct tm t;
  localtime_r(&now, &t);
  time_t end = epochForClock(t, NIGHT_END_HOUR, NIGHT_END_MIN, 0, 0);
  if (end <= now) end = epochForClock(t, NIGHT_END_HOUR, NIGHT_END_MIN, 0, 1);
  return end;
}

static time_t nextAlarmEpoch(const struct tm &base, time_t now) {
  time_t best = 0;
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms[i].enabled) continue;
    time_t cand = epochForClock(base, alarms[i].hour, alarms[i].minute, alarms[i].second, 0);
    if (cand <= now) cand = epochForClock(base, alarms[i].hour, alarms[i].minute, alarms[i].second, 1);
    if (best == 0 || cand < best) best = cand;
  }
  return best;
}

static void releaseNightHolds() {
  gpio_deep_sleep_hold_dis();
  for (auto pin : HOLD_PINS) gpio_hold_dis(pin);
  gpio_hold_dis((gpio_num_t)PA_ENABLE_PIN);
  rtc_gpio_deinit((gpio_num_t)KEY_PIN);
  rtc_gpio_deinit((gpio_num_t)PREVIEW_BUTTON_PIN);
  rtc_gpio_deinit((gpio_num_t)RTC_INT_PIN);
}

static void holdNightPins() {
  pinMode(RLCD_RST_PIN, OUTPUT);  digitalWrite(RLCD_RST_PIN, HIGH);
  pinMode(RLCD_CS_PIN, OUTPUT);   digitalWrite(RLCD_CS_PIN, HIGH);
  pinMode(RLCD_DC_PIN, OUTPUT);   digitalWrite(RLCD_DC_PIN, HIGH);
  pinMode(RLCD_SCK_PIN, OUTPUT);  digitalWrite(RLCD_SCK_PIN, LOW);
  pinMode(RLCD_MOSI_PIN, OUTPUT); digitalWrite(RLCD_MOSI_PIN, LOW);
  pinMode(PA_ENABLE_PIN, OUTPUT); digitalWrite(PA_ENABLE_PIN, LOW);
  for (auto pin : HOLD_PINS) gpio_hold_en(pin);
  gpio_hold_en((gpio_num_t)PA_ENABLE_PIN);
  gpio_deep_sleep_hold_en();
}

static void shutdownNightPeripherals() {
  if (webActive) { server.stop(); webActive = false; }
  stopWifiAndNtp();
  stopPlayback(true);
  shutdownCodec();                 // wylacz ES8311 na czas snu nocnego
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);
}

#if ENABLE_LOW_BATTERY_PROTECT
// Ochronny deep-sleep przy krytycznym stanie ogniwa: chroni Li-ion przed
// glebokim rozladowaniem i sprzetowym brownoutem (ryzyko uszkodzenia FLASH przy
// zapisie). Budzi sie cyklicznie (timer), by sprawdzic ladowanie; KEY pozwala
// wybudzic recznie. Pomijane przy dzwoniacym budziku / audio / sesji WWW /
// podgladzie / aktywnym NTP/zapisie RTC — nie przerywamy interakcji ani alarmu
// (zostaje wtedy ostrzezenie na ekranie, a sen nastapi po powrocie do spoczynku).
// Deep-sleep resetuje chip -> po wybudzeniu setup() ponownie zmierzy ogniwo i
// albo wznowi prace (gdy podlaczono ladowarke), albo usnie dalej.
static void enterCriticalBatterySleepIfNeeded() {
  if (!batteryCritical()) return;
  if (playing || ringing || webActive || previewActive ||
      ntpSyncState != NTP_SYNC_IDLE || rtcWriteRetriesLeft != 0) return;

  Serial.printf("Akumulator krytyczny (%u%%, %.2f V) -> ochronny sen %lu s\n",
                batteryPercent, batteryVoltage, (unsigned long)BATTERY_CRITICAL_RECHECK_SEC);
  drawCriticalBatteryPage();
  delay(150);
  shutdownNightPeripherals();
  setCpuFrequencyMhz(NIGHT_CPU_MHZ);
  watchdogFeed();
  esp_sleep_enable_timer_wakeup((uint64_t)BATTERY_CRITICAL_RECHECK_SEC * 1000000ULL);
  esp_sleep_enable_ext1_wakeup((1ULL << KEY_PIN), ESP_EXT1_WAKEUP_ANY_LOW);  // reczne wybudzenie KEY
  rtc_gpio_pullup_en((gpio_num_t)KEY_PIN);
  rtc_gpio_pulldown_dis((gpio_num_t)KEY_PIN);
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}
#endif

static void enterNightSleepIfNeeded(bool force) {
  struct tm t;
  if (!getLocalTm(&t) || !isNightMode(t)) return;
  if (anyAlarmDueNow(t)) return;                       // budzik w oknie — nie spij
  if (!force && (webActive || playing || ringing || previewActive ||
                 ntpSyncState != NTP_SYNC_IDLE || rtcWriteRetriesLeft != 0)) return;

  time_t now = time(nullptr);
  time_t wakeAt = nightEndEpoch(now);
  time_t alarmAt = nextAlarmEpoch(t, now);
  if (alarmAt > now && alarmAt < wakeAt) wakeAt = alarmAt;

  if (wakeAt <= now) wakeAt = now + 6 * 60 * 60;
  uint64_t sleepSec = (uint64_t)(wakeAt - now);
  if (sleepSec < NIGHT_MIN_SLEEP_SEC) {
    sleepSec = NIGHT_MIN_SLEEP_SEC;
    wakeAt = now + (time_t)sleepSec;
  }

  bool rtcAlarmOk = rtcSetWakeAlarm(wakeAt);
  if (rtcAlarmOk && digitalRead(RTC_INT_PIN) != HIGH) {
    rtcDisableWakeAlarm();
    rtcAlarmOk = false;
  }
  // Bez dzialajacego alarmu RTC jedynym budzeniem jest timer ESP taktowany
  // wewnetrznym oscylatorem RC, ktorego dryft przez kilka godzin moze
  // przekroczyc okno NTP_ALARM_CATCHUP_SEC i cicho pominac budzik. Spij wtedy
  // w odcinkach: kazde wybudzenie kotwiczy czas z PCF85063A (readRtcToSystem
  // w setup) i liczy pozostaly sen od nowa, wiec dryft pojedynczego odcinka
  // jest duzo mniejszy niz okno wylapania budzika.
  if (!rtcAlarmOk) {
    // Budzi tylko timer ESP na niedokladnym oscylatorze RC. Gdy najblizszym
    // zdarzeniem jest realny budzik (wakeAt skrocone do alarmu powyzej), tnij
    // odcinki krocej: dryft RC ostatniego odcinka musi zostac duzo ponizej okna
    // wylapania NTP_ALARM_CATCHUP_SEC, inaczej spoznione wybudzenie gubi budzik.
    bool alarmIsNextEvent = (alarmAt > now && wakeAt == alarmAt);
    uint64_t cap = alarmIsNextEvent ? NIGHT_FALLBACK_ALARM_CHUNK_SEC : NIGHT_FALLBACK_CHUNK_SEC;
    if (sleepSec > cap) sleepSec = cap;
  }
  Serial.printf("Tryb nocny: sleep %llu s, RTC alarm: %s\n",
                (unsigned long long)sleepSec, rtcAlarmOk ? "OK" : "ERR");
  drawNightPage();
  delay(150);
  shutdownNightPeripherals();
  setCpuFrequencyMhz(NIGHT_CPU_MHZ);
  // Timer ESP32 pozostaje zabezpieczeniem, gdyby przerwanie RTC nie dotarlo.
  esp_sleep_enable_timer_wakeup(sleepSec * 1000000ULL);
  uint64_t wakeMask = (1ULL << KEY_PIN) | (1ULL << PREVIEW_BUTTON_PIN);
  if (rtcAlarmOk) wakeMask |= (1ULL << RTC_INT_PIN);
  esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
  rtc_gpio_pullup_en((gpio_num_t)KEY_PIN);  rtc_gpio_pulldown_dis((gpio_num_t)KEY_PIN);
  rtc_gpio_pullup_en((gpio_num_t)PREVIEW_BUTTON_PIN); rtc_gpio_pulldown_dis((gpio_num_t)PREVIEW_BUTTON_PIN);
  if (rtcAlarmOk) {
    rtc_gpio_pullup_en((gpio_num_t)RTC_INT_PIN);
    rtc_gpio_pulldown_dis((gpio_num_t)RTC_INT_PIN);
  }
  watchdogFeed();
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}

// Dynamiczny czas light-sleep: spij do najblizszego zdarzenia, lecz nie dluzej
// niz IDLE_LIGHT_SLEEP_MAX_SEC (60 s). Zdarzenia to:
//   - granica kolejnej minuty -> ekran HH:MM zmienia sie dokladnie na czas,
//   - sekunda najblizszego wlaczonego budzika -> zachowana dokladnosc sekundowa.
// RLCD trzyma ostatni obraz podczas snu, wiec ekran nie gasnie ani nie mruga.
// Przyciski wybudzaja niezaleznie przez EXT1, wiec dluzszy sen ich nie blokuje.
static uint64_t computeIdleSleepUs() {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return IDLE_LIGHT_SLEEP_US;  // czas nieznany -> krotki sen

