Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
static void setupDisplay(bool coldBoot) {
  // Ten egzemplarz ST7305 NIE przywraca obrazu po deep-sleep przez sam
  // initInterface() -> w trybie www off (deep-sleep) ekran zostaje czarny.
  // Dlatego pelny re-init (reset + begin) przy KAZDYM wybudzeniu. Panel po snie
  // jest i tak czarny, wiec wzgledem stanu po snie nie ma dodatkowego mrugania.
  (void)coldBoot;
  pinMode(RLCD_RST_PIN, OUTPUT);
  digitalWrite(RLCD_RST_PIN, HIGH);
  digitalWrite(RLCD_RST_PIN, LOW);
  delay(10);
  digitalWrite(RLCD_RST_PIN, HIGH);
  delay(10);
  // Sprzetowe SPI usuwa ok. 4 s opoznienia pelnego sendBuffer(), ktore przy
  // programowym SPI przesuwalo widoczna zmiane minuty.
  SPI.begin(RLCD_SCK_PIN, -1, RLCD_MOSI_PIN, RLCD_CS_PIN);
  display.setBusClock(2000000UL);      // zalecenie sterownika U8g2 dla ST7305
  display.begin();                     // initDisplay + clearDisplay + powerSave(0): panel zawsze zapalony po wybudzeniu
  gfx = &display;
  gfx->setContrast(255);
}

// ============================================================================
//  setup / loop
// ============================================================================
void setup() {
  // Przyczyne wybudzenia ustalamy NAJPIERW - decyduje o delay(300) (tylko zimny
  // start) oraz o akcji po wybudzeniu (KEY -> panel WWW, BOOT -> podglad,
  // RTC/timer -> wybudzenie planowe). Ekran inicjalizujemy tak samo przy KAZDYM
  // wybudzeniu (patrz setupDisplay).
  esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
  uint64_t ext1WakePins = (cause == ESP_SLEEP_WAKEUP_EXT1) ? esp_sleep_get_ext1_wakeup_status() : 0;
  bool coldBoot = (cause == ESP_SLEEP_WAKEUP_UNDEFINED);
  bool keyWake = coldBoot || cause == ESP_SLEEP_WAKEUP_EXT0 ||
                 ((ext1WakePins & (1ULL << KEY_PIN)) != 0);
  bool previewWake = (ext1WakePins & (1ULL << PREVIEW_BUTTON_PIN)) != 0;
  bool rtcWake = (ext1WakePins & (1ULL << RTC_INT_PIN)) != 0;
  bool userWake = keyWake || previewWake;
  bool scheduledWake = rtcWake || cause == ESP_SLEEP_WAKEUP_TIMER;

  Serial.begin(115200);
  if (coldBoot) delay(300);            // delay tylko na zimnym starcie (USB-CDC); wybudzenia z deep-sleep go pomijaja
  setCpuFrequencyMhz(DAY_CPU_MHZ);
  watchdogSetup();                     // nadzoruj loopTask juz od setup() (timeout WDT_TIMEOUT_S)
  releaseNightHolds();
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);
  setupDisplay(coldBoot);              // pelny re-init (reset RST + begin) przy KAZDYM wybudzeniu; brak mrugania w dzien zapewnia light-sleep (setup() sie nie powtarza)

  if (coldBoot) {                       // tylko cold boot - RTC RAM przezywa deep-sleep
    resetTriggerState();
    ntpStartedDay = -1;
    ntpMorningDay = -1;
    batteryHasReading = false; batteryPercent = 0; batteryVoltage = 0.0f;
    g_drain.valid = false;
    g_lastSummaryDay = -1;
    g_wifiHint = false;
    g_bootCount = 0;                    // diagnostyka: zerowane tylko na zimnym starcie
    g_coldBootEpoch = 0;
    g_lastRtcDriftSec = 0;
    g_lastNtpSyncEpoch = 0;
    g_prevNtpSyncEpoch = 0;
  }
  g_bootCount++;                        // cold boot -> 1; kazde wybudzenie z deep-sleep -> +1

  setenv("TZ", TZ_POLAND, 1);
  tzset();

  pinMode(KEY_PIN, INPUT_PULLUP);
  pinMode(PREVIEW_BUTTON_PIN, INPUT_PULLUP);
  pinMode(RTC_INT_PIN, INPUT_PULLUP);
  keyRaw = digitalRead(KEY_PIN);  keyStable = keyRaw;  keyChangedMs = millis();
  bootRaw = digitalRead(PREVIEW_BUTTON_PIN); bootStable = bootRaw; bootChangedMs = millis();

  loadSettings();
#if ENABLE_DIAGNOSTICS
  recordResetReason(esp_reset_reason());   // policz brownout/WDT/panic (NVS, zdarzenia rzadkie)
#endif
  Serial.printf("\n=== %s v%s  (build %s %s) ===\n",
                FW_NAME, FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME);
  Serial.printf("Rozruch #%u, przyczyna resetu: %s\n",
                g_bootCount, resetReasonText(esp_reset_reason()));
  updateBattery(true);               // ekran zainicjowany wczesniej w setupDisplay()

  bool timeFromRtc = readRtcToSystem();
  rtcApplyOffsetCalibration();          // kalibracja dryftu krysztalu (rejestr Offset 0x02)
  bool rtcAlarmCleared = rtcDisableWakeAlarm();
  ntpStatus = timeFromRtc ? "czas z RTC" : "RTC pusty/brak";
  if (rtcWake && !rtcAlarmCleared) ntpStatus = "RTC alarm: blad kasowania";
#if ENABLE_DIAGNOSTICS
  { time_t t0 = time(nullptr);          // zakotwicz czas pracy, gdy czas juz znany
    if (g_coldBootEpoch == 0 && isSupportedEpoch(t0)) g_coldBootEpoch = (int64_t)t0; }
#endif

  codec.powerDown();   // ES8311 ma wystartowac w stanie niskiego poboru pradu

  if (coldBoot) ensureFsMounted();   // FS potrzebny tylko do MP3; cieplo montuj leniwie (startSound/web) -> krotsze wybudzenie
  checkAlarms(scheduledWake ? NTP_ALARM_CATCHUP_SEC : ALARM_LATE_WINDOW_SEC);
  if (!userWake && !ringing) enterNightSleepIfNeeded(true);
#if ENABLE_LOW_BATTERY_PROTECT
  // Ochrona ogniwa juz na starcie: po planowym wybudzeniu z krytycznym poziomem
  // od razu wracaj do ochronnego snu. Wybudzenie uzytkownika (KEY/BOOT) pomijamy,
  // by mogl zobaczyc stan i podlaczyc ladowarke.
  if (!userWake && !ringing) enterCriticalBatterySleepIfNeeded();
#endif

  if (keyWake && !ringing) startWebWindow();
  else stopWifiAndNtp();
  if (previewWake) showPreview();

  // Zimny start zawsze koryguje RTC z NTP. Po zwyklym wybudzeniu z deep-sleep
  // wystarcza czas podtrzymywany przez RTC.
  struct tm wakeTm;
  bool haveWakeTime = getLocalTm(&wakeTm);
  if (coldBoot || !timeFromRtc) {
    ntpRetriesLeft = timeFromRtc ? 2 : 6;
    ntpFailureRetryDelayMs = timeFromRtc ? NTP_RETRY_MS : 30000UL;
    syncNtp(false);
  } else if (scheduledWake && haveWakeTime && !isNightMode(wakeTm) &&
#if ENABLE_LOW_BATTERY_PROTECT
             !batteryLow() &&          // tryb oszczedny: pomin poranny re-sync NTP
#endif
             ntpMorningDay != localDayKey(wakeTm)) {
    // Wyjatek: pierwsze planowe wybudzenie z nocnego deep-sleep do czesci dziennej
    // (~06:00). Po ~20 h od synchronizacji 10:00 sam RTC bywa spozniony > 1 s, a rano
    // uzytkownik patrzy na zegar -> odswiez czas z NTP raz dziennie. WiFi wstaje na
    // kilka s (koszt energii pomijalny). Gdy WiFi padnie: retry + zostaje czas z RTC.
    // Warunek !isNightMode lapie tez przeskoczone okno przy budzeniu timerem RC.
    ntpMorningDay = localDayKey(wakeTm);
    ntpRetriesLeft = 2;
    ntpFailureRetryDelayMs = NTP_RETRY_MS;
    syncNtp(false);
  }

  displayDirty = true;
}

static void applyCpuPolicy() {
#if IDLE_CPU_DOWNCLOCK
  static int curMhz = DAY_CPU_MHZ;
  bool needFast = webActive || playing || ringing || ntpSyncState != NTP_SYNC_IDLE;
  int want = needFast ? DAY_CPU_MHZ : IDLE_CPU_MHZ;
  if (want != curMhz) { setCpuFrequencyMhz(want); curMhz = want; }
#endif
}

void loop() {
  watchdogFeed();                  // nakarm watchdoga na poczatku kazdej iteracji
  applyCpuPolicy();
  handleKey();
  handleBoot();
  enterNightSleepIfNeeded(false);

