Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v5.0.ino
  if (webActive) {
    static uint32_t wifiLostMs = 0;
    if (WiFi.status() != WL_CONNECTED) {
      // Chwilowy zanik lacza (utrata beaconow, roaming AP) nie zamyka okna WWW
      // od razu: auto-reconnect zwykle wraca w kilka sekund, a natychmiastowe
      // WIFI_OFF by go ubilo i kasowalo sesje uzytkownika w srodku edycji.
      if (wifiLostMs == 0) wifiLostMs = millis();
      if (millis() - wifiLostMs > WEB_WIFI_GRACE_MS) {
        wifiLostMs = 0;
        statusText = "WiFi rozlaczone";
        stopWebWindow();
      }
    } else {
      wifiLostMs = 0;
      server.handleClient();
      if ((int32_t)(millis() - webUntilMs) >= 0) stopWebWindow();
    }
  }

  serviceAudio();
  serviceRinging();
  updateBattery(false);
#if ENABLE_LOW_BATTERY_PROTECT
  enterCriticalBatterySleepIfNeeded();   // ochronny sen, gdy ogniwo krytyczne i petla bezczynna
#endif
  // SNTP ustawia czas w swoim zadaniu; najpierw zatwierdz lub cofnij korekte.
  bool ntpAdjustedTime = serviceNtp();
  // Okno spoznienia poszerzone o realny przestoj petli: dlugi server.handleClient()
  // (upload MP3 potrafi blokowac minuty) ani 60-sekundowy light-sleep nie moga
  // zgubic budzika, ktorego termin wypadl w trakcie przestoju.
  static uint32_t lastAlarmCheckMs = 0;
  uint32_t loopGapSec = lastAlarmCheckMs ? (millis() - lastAlarmCheckMs) / 1000UL : 0;
  lastAlarmCheckMs = millis();
  uint32_t lateWindowSec = ntpAdjustedTime ? NTP_ALARM_CATCHUP_SEC : ALARM_LATE_WINDOW_SEC;
  if (loopGapSec + 2 > lateWindowSec) lateWindowSec = loopGapSec + 2;
  checkAlarms(lateWindowSec);
  checkNtpSchedule();
  handleRtcWriteRetry();
  updateDisplay();
  idlePowerSave();
}
